Strogino/src/Documents/ЗаказПоставщику/ЗаказПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПоставщику</name>
  <registerRecords>AccumulationRegister.РасчетыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.Дефектура</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДеньНочь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодЗаказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентПрайса</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПрайсаПоставщика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТовараПоставщика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОтказ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэфДеления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокГодности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.Заказ</types>
      </type>
    </attributes>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Strogino/src/AccumulationRegisters/Дефектура/Дефектура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Дефектура</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Заказ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючСвязи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦенаЗакупки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СрокГодности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Strogino/src/Documents/ЗаказПоставщику/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Дефектура.Записывать = Истина;
	Движения.Дефектура.Очистить();
	Движения.Дефектура.Записать(Истина);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	ГраницаКонтроля = Новый Граница(МоментВремени(), ВидГраницы.Исключая);
	Запрос.УстановитьПараметр("МоментВремени", ГраницаКонтроля);

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказПоставщику.Склад КАК Склад,
		|	ЗаказПоставщику.Товар КАК Товар,
		|	ЗаказПоставщику.Количество - ЗаказПоставщику.КоличествоОтказ КАК Количество
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщику
		|ГДЕ
		|	ЗаказПоставщику.Ссылка = &Ссылка
		|	И ЗаказПоставщику.Количество - ЗаказПоставщику.КоличествоОтказ > 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Товар,
		|	Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДефектураОстатки.Склад,
		|	ДефектураОстатки.Товар,
		|	ДефектураОстатки.Заказ,
		|	ДефектураОстатки.КлючСвязи,
		|	ДефектураОстатки.Поставщик,
		|	ДефектураОстатки.ДатаДоставки,
		|	ДефектураОстатки.ЦенаЗакупки,
		|	ДефектураОстатки.СрокГодности,
		|	СУММА(ДефектураОстатки.КоличествоОстаток) КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_ОстаткиДефектуры
		|ИЗ
		|	РегистрНакопления.Дефектура.Остатки(
		|			&МоментВремени,
		|			Поставщик = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|				И Товар В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВТ_Товары.Товар КАК Товар
		|					ИЗ
		|						ВТ_Товары КАК ВТ_Товары)
		|				И Склад В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВТ_Товары.Склад КАК Склад
		|					ИЗ
		|						ВТ_Товары КАК ВТ_Товары)) КАК ДефектураОстатки
		|ГДЕ
		|	ДефектураОстатки.КоличествоОстаток > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ДефектураОстатки.Склад,
		|	ДефектураОстатки.Товар,
		|	ДефектураОстатки.Заказ,
		|	ДефектураОстатки.КлючСвязи,
		|	ДефектураОстатки.Поставщик,
		|	ДефектураОстатки.ДатаДоставки,
		|	ДефектураОстатки.СрокГодности,
		|	ДефектураОстатки.ЦенаЗакупки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОстаткиДефектуры.Склад,
		|	ВТ_ОстаткиДефектуры.Товар,
		|	ВТ_ОстаткиДефектуры.Заказ,
		|	ВТ_ОстаткиДефектуры.КлючСвязи,
		|	ВТ_ОстаткиДефектуры.Поставщик,
		|	ВТ_ОстаткиДефектуры.ДатаДоставки,
		|	ВТ_ОстаткиДефектуры.ЦенаЗакупки,
		|	ВТ_ОстаткиДефектуры.СрокГодности,
		|	ВТ_ОстаткиДефектуры.КоличествоОстаток
		|ИЗ
		|	ВТ_ОстаткиДефектуры КАК ВТ_ОстаткиДефектуры";

		ОстаткиДефектуры = Запрос.Выполнить().Выгрузить();
		Запрос.Текст = "
		|
		|ВЫБРАТЬ
		|	ВТ_Товары.Склад,
		|	ВТ_Товары.Товар,
		|	ВТ_Товары.Количество
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары";
		
		ТабДвижений = Движения.Дефектура.ВыгрузитьКолонки();
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл

			ОсталосьРаспределить = РезультатЗапроса.Количество;
			Для каждого СтрокаТЧ Из ОстаткиДефектуры Цикл
				Если СтрокаТЧ.Склад = РезультатЗапроса.Склад
					И СтрокаТЧ.Товар = РезультатЗапроса.Товар
					И СтрокаТЧ.КоличествоОстаток > 0 Тогда
					
					текКоличество = Мин(ОсталосьРаспределить, СтрокаТЧ.КоличествоОстаток);
					Движение = ТабДвижений.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
					Движение.Период = Дата;
					Движение.Склад = СтрокаТЧ.Склад;
					Движение.Товар = СтрокаТЧ.Товар;
					Движение.Заказ = СтрокаТЧ.Заказ;
					Движение.КлючСвязи = СтрокаТЧ.КлючСвязи;
					Движение.Количество = текКоличество;

					Движение = ТабДвижений.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = Дата;
					Движение.Склад = СтрокаТЧ.Склад;
					Движение.Товар = СтрокаТЧ.Товар;
					Движение.Заказ = СтрокаТЧ.Заказ;
					Движение.КлючСвязи = СтрокаТЧ.КлючСвязи;
					Движение.Поставщик = Клиент;
					Движение.ДатаДоставки = ДатаДоставки;
					Движение.Количество = текКоличество;

					ОсталосьРаспределить = ОсталосьРаспределить - текКоличество;
					Если ОсталосьРаспределить = 0 Тогда
						Прервать;
					КонецЕсли; 
				КонецЕсли; 
			КонецЦикла; 
			
			Если ОсталосьРаспределить > 0 Тогда

				Движение = ТабДвижений.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Склад = РезультатЗапроса.Склад;
				Движение.Товар = РезультатЗапроса.Товар;
				Движение.Поставщик = Клиент;
				Движение.ДатаДоставки = ДатаДоставки;
				Движение.Количество = ОсталосьРаспределить;

			КонецЕсли; 
			
		КонецЦикла; 

		ТабДвижений.Свернуть("ВидДвижения, Период, Склад, Товар, Заказ, КлючСвязи, Поставщик, ДатаДоставки","Количество");
//		ТабДвижений.Сортировать("ВидДвижения");
		Движения.Дефектура.Загрузить(ТабДвижений);
		
		Если Константы.ВестиРасчетыСПоставщиками.Получить() Тогда

			Движения.РасчетыСПоставщиками.Записывать = Истина;
			Движения.РасчетыСПоставщиками.Очистить();

			Движение = Движения.РасчетыСПоставщиками.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Поставщик = ЭтотОбъект.Клиент;
			Движение.ЗаказПоставщику = ЭтотОбъект.Ссылка;
			Движение.Сумма = ЭтотОбъект.Товары.Итог("Сумма");

		КонецЕсли; 
		Движения.Записать();


		
		
	//	// Проверим образовался ли отрицательный остаток

	//	Запрос.Текст =
	//		"ВЫБРАТЬ
	//		|	Остатки.Товар КАК Товар,
	//		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(Остатки.Товар) КАК ТоварПредставление,
	//		|	-Остатки.КоличествоОстаток КАК Дефецит
	//		|ИЗ
	//		|	РегистрНакопления.Дефектура.Остатки(
	//		|			&МоментВремени,
	//		|			Товар В
	//		|				(ВЫБРАТЬ
	//		|					ВТ_Товары.Товар КАК Товар
	//		|				ИЗ
	//		|					ВТ_Товары КАК ВТ_Товары)) КАК Остатки
	//		|ГДЕ
	//		|	Остатки.КоличествоОстаток < 0";

	//		ГраницаКонтроля = Новый Граница(МоментВремени(), ВидГраницы.Включая);
	//		Запрос.УстановитьПараметр("МоментВремени", ГраницаКонтроля);
	//		РезультатЗапроса = Запрос.Выполнить();
	//		
	//		Если Не РезультатЗапроса.Пустой() Тогда

	//			Отказ = Истина;
	//			ВыборкаОшибки = РезультатЗапроса.Выбрать();
	//			Пока ВыборкаОшибки.Следующий() Цикл
	//				Сообщение = Новый СообщениеПользователю;
	//				Сообщение.Текст = "Товара " + ВыборкаОшибки.ТоварПредставление + " недостаточно в количестве " + ВыборкаОшибки.Дефецит + " шт.";
	//				Сообщение.Сообщить();
	//			КонецЦикла;

	//		КонецЕсли;

КонецПроцедуры
